In [2]:
import pandas as pd
import numpy as np

s = pd.Series([85,95,90], index = ['Korean','Math','English'])
s.index
s.values
s.dtype

dtype('int64')

In [3]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Seoul', 'Busan', 'Incheon']
}

df = pd.DataFrame(data)
print(df)

      Name  Age     City
0    Alice   25    Seoul
1      Bob   30    Busan
2  Charlie   35  Incheon

In [4]:
data = {"Student": ["Tom", "Jane", "Mike"],
"Score": [87, 92, 78],
"Passed": [True, True, False]
}

df = pd.DataFrame(data)
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [5]:
df.columns

Index(['Student', 'Score', 'Passed'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  3 non-null      object
 1   Score    3 non-null      int64
 2   Passed   3 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 183.0+ bytes

In [8]:
df.describe()

           Score
count   3.000000
mean   85.666667
std     7.094599
min    78.000000
25%    82.500000
50%    87.000000
75%    89.500000
max    92.000000

In [9]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [10]:
df["Score"]
df[["Student","Passed"]]
df.loc[0]
df.iloc[2]

Student     Mike
Score         78
Passed     False
Name: 2, dtype: object

In [11]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [12]:
df[df["Score"] >= 90]

  Student  Score  Passed
1    Jane     92    True

In [13]:
df[df['Passed'] != True]

  Student  Score  Passed
2    Mike     78   False

In [14]:
df[ (df["Score"] >= 85) & (df['Passed'] == True)]

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True

In [15]:
df[df["Student"] == "Jane"]

  Student  Score  Passed
1    Jane     92    True

In [16]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [17]:
df.sort_values("Score")
df.sort_values("Score",ascending = False)
df.sort_values(by=["Passed","Score"])
df.sort_index()

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [18]:
df

  Student  Score  Passed
0     Tom     87    True
1    Jane     92    True
2    Mike     78   False

In [20]:
df["Grade"] = ["B", "A", "C"]
df
# df["score2"] = df["Score"] + 5
# df.loc[3] = ["Sara", 88, True, "B", 93]

  Student  Score  Passed Grade
0     Tom     87    True     B
1    Jane     92    True     A
2    Mike     78   False     C

In [22]:
df["score2"] = df["Score"] + 5
df

  Student  Score  Passed Grade  score2
0     Tom     87    True     B      92
1    Jane     92    True     A      97
2    Mike     78   False     C      83

In [23]:
df.loc[3] = ["Sara", 88, True, "B", 93]
df

  Student  Score  Passed Grade  score2
0     Tom     87    True     B      92
1    Jane     92    True     A      97
2    Mike     78   False     C      83
3    Sara     88    True     B      93

In [24]:
df.drop(3, axis = 0, inplace=True)
df

  Student  Score  Passed Grade  score2
0     Tom     87    True     B      92
1    Jane     92    True     A      97
2    Mike     78   False     C      83

In [26]:
import numpy as np

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Score": [85, np.nan, 78, np.nan],
    "Passed": [True, True, False, np.nan]
})
df

      Name  Score Passed
0    Alice   85.0   True
1      Bob    NaN   True
2  Charlie   78.0  False
3    David    NaN    NaN

In [27]:
df.isnull()

    Name  Score  Passed
0  False  False   False
1  False   True   False
2  False  False   False
3  False   True    True

In [28]:
df.isnull().sum()

Name      0
Score     2
Passed    1
dtype: int64

In [29]:
df.dropna()

      Name  Score Passed
0    Alice   85.0   True
2  Charlie   78.0  False

In [30]:
df.dropna(axis=1)

      Name
0    Alice
1      Bob
2  Charlie
3    David

In [31]:
df.fillna(0)

      Name  Score Passed
0    Alice   85.0   True
1      Bob    0.0   True
2  Charlie   78.0  False
3    David    0.0      0

In [34]:
df["Score"].fillna(df["Score"].mean())

0    85.0
1    81.5
2    78.0
3    81.5
Name: Score, dtype: float64

In [35]:
df["Passed"].fillna(method="ffill")

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2004\1230094823.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Passed"].fillna(method="ffill")
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2004\1230094823.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df["Passed"].fillna(method="ffill")

0     True
1     True
2    False
3    False
Name: Passed, dtype: bool

In [36]:
df["Passed"].fillna(method="bfill")

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_2004\2840239724.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Passed"].fillna(method="bfill")

0     True
1     True
2    False
3      NaN
Name: Passed, dtype: object

In [37]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Score": [85, np.nan, 78, np.nan],
    "Passed": [True, True, False, np.nan]
})
df

      Name  Score Passed
0    Alice   85.0   True
1      Bob    NaN   True
2  Charlie   78.0  False
3    David    NaN    NaN